### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dev.data.ml_config.cfg will be read during apply
  # (config refers to values not yet known)
 <= data "ml_config" "cfg"  {
!       id                      = "1633153138" -> (known after apply)
!       service_account         = "service-1071890620895@cloud-ml.google.com.iam.gserviceaccount.com" -> (known after apply)
!       service_account_project = 169912574071 -> (known after apply)
!       tpu_service_account     = "service-169912574071@cloud-tpu.iam.gserviceaccount.com" -> (known after apply)
    }

  # module.dev.google_app_engine_standard_app_version.fmltc-app-v1 will be updated in-place
!   resource "google_app_engine_standard_app_version" "fmltc-app-v1" {
        id                        = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        name                      = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        # (9 unchanged attributes hidden)


!       deployment {

!           zip {
!               source_url  = "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/83cea86df869eccf192c97c95b291893.zip" -> "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/ee14a53872822f1dbe7158b6e97aa74b.zip"
                # (1 unchanged attribute hidden)
            }
        }


-       handlers {
-           auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT" -> null
-           login            = "LOGIN_OPTIONAL" -> null
-           security_level   = "SECURE_OPTIONAL" -> null
-           url_regex        = ".*" -> null

-           script {
-               script_path = "auto" -> null
            }
        }


        # (8 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.frame-extraction will be destroyed
-   resource "google_cloudfunctions_function" "frame-extraction" {
-       available_memory_mb   = 8192 -> null
-       description           = "Extracts frames after a video upload" -> null
-       entry_point           = "perform_action" -> null
-       environment_variables = {
-           "project_id" = "ftc-ml-firstinspires-dev"
        } -> null
-       id                    = "projects/ftc-ml-firstinspires-dev/locations/us-central1/functions/perform_action" -> null
-       ingress_settings      = "ALLOW_ALL" -> null
-       labels                = {} -> null
-       max_instances         = 0 -> null
-       name                  = "perform_action" -> null
-       project               = "ftc-ml-firstinspires-dev" -> null
-       region                = "us-central1" -> null
-       runtime               = "python39" -> null
-       service_account_email = "ftc-ml-firstinspires-dev@appspot.gserviceaccount.com" -> null
-       source_archive_bucket = "ftc-ml-firstinspires-dev-gcf-source" -> null
-       source_archive_object = "505cffa8aae34ab1eb5a4adcc1687501.zip" -> null
-       timeout               = 540 -> null

-       event_trigger {
-           event_type = "google.storage.object.finalize" -> null
-           resource   = "projects/ftc-ml-firstinspires-dev/buckets/ftc-ml-firstinspires-dev-action-parameters" -> null

-           failure_policy {
-               retry = false -> null
            }
        }

-       timeouts {
-           create = "60m" -> null
-           update = "60m" -> null
        }
    }

  # module.dev.google_cloudfunctions_function.perform-action will be created
+   resource "google_cloudfunctions_function" "perform-action" {
+       available_memory_mb           = 8192
+       description                   = "Performs long running actions, such as extracting frames after a video upload"
+       entry_point                   = "perform_action"
+       environment_variables         = {
+           "project_id" = "ftc-ml-firstinspires-dev"
        }
+       https_trigger_url             = (known after apply)
+       id                            = (known after apply)
+       ingress_settings              = "ALLOW_ALL"
+       max_instances                 = 0
+       name                          = "perform_action"
+       project                       = (known after apply)
+       region                        = (known after apply)
+       runtime                       = "python39"
+       service_account_email         = (known after apply)
+       source_archive_bucket         = "ftc-ml-firstinspires-dev-gcf-source"
+       source_archive_object         = "1ec506ffc412a6edc66028d3c6dd9f25.zip"
+       timeout                       = 540
+       vpc_connector_egress_settings = (known after apply)

+       event_trigger {
+           event_type = "google.storage.object.finalize"
+           resource   = "ftc-ml-firstinspires-dev-action-parameters"

+           failure_policy {
+               retry = (known after apply)
            }
        }

+       timeouts {
+           create = "60m"
+           update = "60m"
        }
    }

  # module.dev.google_project_iam_binding.tpu_role will be updated in-place
!   resource "google_project_iam_binding" "tpu_role" {
        id      = "ftc-ml-firstinspires-dev/roles/ml.serviceAgent"
!       members = [
-           "serviceAccount:service-1071890620895@cloud-ml.google.com.iam.gserviceaccount.com",
-           "serviceAccount:service-169912574071@cloud-tpu.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_project_service.gcp_services["secretmanager.googleapis.com"] will be created
+   resource "google_project_service" "gcp_services" {
+       disable_dependent_services = true
+       disable_on_destroy         = true
+       id                         = (known after apply)
+       project                    = (known after apply)
+       service                    = "secretmanager.googleapis.com"
    }

  # module.dev.google_storage_bucket_object.app-server-archive must be replaced
-/+ resource "google_storage_bucket_object" "app-server-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "Nm69tQ==" -> (known after apply)
!       detect_md5hash   = "g86obfhp7M8ZLJfJWykYkw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gae-source-83cea86df869eccf192c97c95b291893.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "g86obfhp7M8ZLJfJWykYkw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/83cea86df869eccf192c97c95b291893.zip?generation=1633153140722693&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "83cea86df869eccf192c97c95b291893.zip" -> "ee14a53872822f1dbe7158b6e97aa74b.zip" # forces replacement
!       output_name      = "83cea86df869eccf192c97c95b291893.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/83cea86df869eccf192c97c95b291893.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.cloud-function-archive must be replaced
-/+ resource "google_storage_bucket_object" "cloud-function-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "6SL2nQ==" -> (known after apply)
!       detect_md5hash   = "UFz/qKrjSrHrWkrcwWh1AQ==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gcf-source-505cffa8aae34ab1eb5a4adcc1687501.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "UFz/qKrjSrHrWkrcwWh1AQ==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/505cffa8aae34ab1eb5a4adcc1687501.zip?generation=1633153140690472&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "505cffa8aae34ab1eb5a4adcc1687501.zip" -> "1ec506ffc412a6edc66028d3c6dd9f25.zip" # forces replacement
!       output_name      = "505cffa8aae34ab1eb5a4adcc1687501.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/505cffa8aae34ab1eb5a4adcc1687501.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```
</details>